Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Espressif Systems is a fabless chip manufacturer that produces the ESP32 series of system on chips, these chips can be based on Xtensa or Risc-V architectures, and they feature the common set of analog and digital peripherals of a general purpose microcontroller combined to a radio subsystem capable to run a Bluetooth and/or a WiFi stack.
it_it: Espressif Systems è un produttore di chip "fabless" che realizza la serie ESP32 di "system on chip". Questi chip possono essere basati su architetture Xtensa o Risc-V e presentano il set comune di periferiche analogiche e digitali di un microcontrollore generico, combinato con un sottosistema radio in grado di gestire uno stack Bluetooth e/o WiFi.

source: Espressif provides these drivers that are built on its `esp_lcd <https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/lcd/index.html>`__ component.
it_it: Espressif fornisce questi driver basati sul suo componente `esp_lcd <https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/lcd/index.html>`__.

source: Espressif, via its component manager system, provides a ready to use LVGL porting component, which is the recommended and preferred way of integrating input and output devices from the ESP32 chip to the LVGL Display subsystem, this component is covered in :ref:`Add LVGL to an ESP32 IDF project <lvgl_esp_idf>`
it_it: Espressif, tramite il suo sistema di gestione dei componenti, fornisce un componente di porting LVGL pronto all'uso, che rappresenta il metodo consigliato e preferibile per integrare i dispositivi di input e output dal chip ESP32 al sottosistema Display LVGL. Questo componente è trattato in :ref:`Aggiungere LVGL a un progetto ESP32 IDF <lvgl_esp_idf>`

source: Essentially those buffer the :code:`input_event` generated by the device pointed to by the :code:`input` phandle or if left empty the binding captures all events regardless of the source.
it_it: In sostanza, questi bufferizzano l'evento :code:`input_event` generato dal dispositivo puntato dal phandle :code:`input` oppure, se lasciato vuoto, il binding cattura tutti gli eventi indipendentemente dalla sorgente.

source: Etc.
it_it: Ecc.

source: Evaluation Boards
it_it: Evaluation Board

source: Even developing a UEFI BIOS is an option.
it_it: Anche lo sviluppo di un BIOS UEFI è un'opzione.

source: Even the same event callback can be used on a Widget with different ``user_data``.
it_it: Anche lo stesso callback di evento può essere utilizzato su un Widget con ``user_data`` diversi.

source: Even though this option is available the user is responsible to explicitly enable it on the display driver of the LVGL port component.
it_it: Sebbene questa opzione sia disponibile, l'utente è responsabile di abilitarla esplicitamente sul driver del display del porting del componente LVGL.

source: Even with different chip manufacturers, as long as they use the same version of VG-Lite API as the rendering backend, LVGL rendering acceleration can be supported without the need for LVGL adaptation work.
it_it: Anche con diversi produttori di chip, purché utilizzino la stessa versione dell'API VG-Lite come backend di rendering, l'accelerazione del rendering LVGL può essere supportata senza la necessità di adattamenti LVGL.

source: Event
it_it: Evento

source: Event Codes
it_it: Codici Evento

source: Event Handling
it_it: Gestione degli Eventi

source: Event bubbling
it_it: Evento "bubbling"

source: Event callbacks
it_it: Callback degli eventi

source: Event callbacks receive the argument :cpp:expr:`lv_event_t * e` containing the current event code and other event-related information.
it_it: Le callback degli eventi ricevono l'argomento :cpp:expr:`lv_event_t * e` contenente il codice dell'evento corrente e altre informazioni relative all'evento.

source: Event trickle-down
it_it: Evento "trickle-down"

source: Event-Driven Mode
it_it: Modalità Event-Driven

source: Event-based collection:
it_it: Raccolta basata su eventi:

source: Events
it_it: Eventi

source: Events are triggered in LVGL when something happens which might be interesting to the user, e.g. when a Widget:
it_it: Gli eventi vengono attivati in LVGL quando accade qualcosa che potrebbe essere interessante per l'utente, ad esempio quando un Widget:

source: Events are used to inform the application that something has happened with a Widget.
it_it: Gli eventi vengono utilizzati per informare l'applicazione che si è verificato qualcosa con un widget.

source: Events in XML
it_it: Eventi in XML

source: Every MCU which is capable of driving a display via parallel port, SPI, RGB interface or anything else and fulfills the :ref:`requirements` is supported by LVGL.
it_it: Tutti i MCU in grado di pilotare un display tramite porta parallela, SPI, interfaccia RGB o altro e che soddisfano i :ref:`requirements` sono supportati da LVGL.

source: Every display can have a different theme.
it_it: Ogni display può avere un tema diverso.

source: Every use of an :ref:`Input Device <indev>` counts as activity.
it_it: Ogni utilizzo di un :ref:`Input Device <indev>` conta come attività.

source: Every widget has its own **create** function with a prototype like this:
it_it: Ogni widget ha la sua funzione **create** con un prototipo come questo:

source: Everything is setup, time to build the image::
it_it: Tutto è configurato, è ora di compilare l'immagine:

source: Exactly how that happens is designed to be flexible, and can morph with the needs of the application.
it_it: Il modo esatto in cui ciò avviene è progettato per essere flessibile e può adattarsi alle esigenze dell'applicazione.

source: Example
it_it: Esempio

source: Example (requires :c:macro:`LV_USE_PRIVATE_API` to ``1`` in ``lv_conf.h``):
it_it: Esempio (richiede :c:macro:`LV_USE_PRIVATE_API` a ``1`` in ``lv_conf.h``):

source: Example Arduino sketch
it_it: Sketch di esempio per Arduino

source: Example XML translation definition:
it_it: Esempio di definizione di traduzione XML:

source: Example code is welcome if applicable.
it_it: Se applicabile, è gradito un codice di esempio.

source: Example of the latter: :cpp:expr:`lv_style_set_text_color(&span->style, lv_palette_main(LV_PALETTE_RED))`.
it_it: Esempio di quest'ultimo: :cpp:expr:`lv_style_set_text_color(&span->style, lv_palette_main(LV_PALETTE_RED))`.

source: Example of usage:
it_it: Esempio di utilizzo:

source: Example paths:
it_it: Path di esempio:

source: Example structure
it_it: Struttura di esempio

source: Example with driver identifier letter ``'S'``:
it_it: Esempio con la lettera identificativa del driver ``'S'``:

source: Example with local Style: :cpp:expr:`lv_obj_set_style_length(scale, 5, LV_PART_INDICATOR)` for major ticks and :cpp:expr:`lv_obj_set_style_length(scale, 5, LV_PART_ITEMS)` for minor ticks.
it_it: Esempio con Stile locale: :cpp:expr:`lv_obj_set_style_length(scale, 5, LV_PART_INDICATOR)` per le tacche principali e :cpp:expr:`lv_obj_set_style_length(scale, 5, LV_PART_ITEMS)` per le tacche secondarie.

source: Example with the encoder device to assign a :code:`lv_group_t`:
it_it: Esempio con il dispositivo encoder per assegnare un :code:`lv_group_t`:

source: Example with ticks and labels drawn *on top of* the main line:
it_it: Esempio con tacche ed etichette disegnate *sopra* la linea principale:

source: Example with with ticks and labels drawn *under* the main line (default):
it_it: Esempio con tacche ed etichette disegnate *sotto* la linea principale (il default):

source: Example:
it_it: Esempio:

source: Example: 458 means 45.8\ |deg|\ .
it_it: Esempio: 458 significa 45.8\ |deg|\ .

source: Example: :cpp:expr:`lv_label_set_text_fmt(label, "Value: %d", 15)`.
it_it: Esempio: :cpp:expr:`lv_label_set_text_fmt(label, "Value: %d", 15)`.

source: Example: JPG images are decoded to RGB888 and PNG images are decoded to ARGB8888.
it_it: Esempio: le immagini JPG vengono decodificate in RGB888 e le immagini PNG in ARGB8888.

source: Example: ``lv_align_t``.
it_it: Esempio: ``lv_align_t``.

source: Example: a ``progress`` value of :cpp:expr:`LV_ANIM_TIMELINE_PROGRESS_MAX / 2` would set the Timeline play to its half-way point.
it_it: Esempio: un valore ``progress`` di :cpp:expr:`LV_ANIM_TIMELINE_PROGRESS_MAX / 2` imposterebbe la riproduzione della Timeline a metà.

source: Example: an object's child-Widget count or scroll position must be controlled via other types of input, but their values are readable through this API.
it_it: Esempio: il conteggio dei Widget figli o la posizione di scorrimento di un oggetto devono essere controllati tramite altri tipi di input, ma i loro valori sono leggibili tramite questa API.

source: Example: if the following 6 Widgets are created in this sequence:
it_it: Esempio: se i seguenti 6 widget vengono creati in questa sequenza:

source: Example: you set :c:macro:`LV_LOG_LEVEL` to :c:macro:`LV_LOG_LEVEL_WARN`, then :c:macro:`LV_LOG_LEVEL_WARN`, :c:macro:`LV_LOG_LEVEL_ERROR` and :c:macro:`LV_LOG_LEVEL_USER` messages will be logged.
it_it: Esempio: se si imposta :c:macro:`LV_LOG_LEVEL` su :c:macro:`LV_LOG_LEVEL_WARN`, verranno registrati i messaggi :c:macro:`LV_LOG_LEVEL_WARN`, :c:macro:`LV_LOG_LEVEL_ERROR` e :c:macro:`LV_LOG_LEVEL_USER`.

source: Example: :cpp:expr:`lv_obj_find_by_name(cont, "mybtn_1")` Note that ``"mybtn_1"`` is a child of ``cont`` at any level, not necessarily a direct child.
it_it: Esempio: :cpp:expr:`lv_obj_find_by_name(cont, "mybtn_1")` Notare che ``"mybtn_1"`` è un elemento figlio di ``cont`` a qualsiasi livello, non necessariamente un elemento figlio diretto.

source: Example: :cpp:expr:`lv_obj_get_child_by_name(header, "title")`.
it_it: Esempio: :cpp:expr:`lv_obj_get_child_by_name(header, "title")`.

source: Example: Selecting Highest Resolution
it_it: Esempio: Selezione della risoluzione più alta

source: Example: Selecting Preferred Mode
it_it: Esempio: Selezione della modalità preferita

# Example: ``"First Second Third"``.
source: Example: ``"First\nSecond\nThird"``.
it_it: Esempio: ``"First\nSecond\nThird"``.

source: Example: if a Widget has focus the user will still want to see if it's pressed, therefore the pressed state has a higher precedence.
it_it: Esempio: se un Widget ha il focus, l'utente vorrà comunque vedere se è premuto, quindi lo stato "pressed" ha una precedenza maggiore.

source: Examples of Widgets: :ref:`Base Widget (and Screen) <base_widget>`, :ref:`Button <lv_button>`, :ref:`Label <lv_label>`, :ref:`Image <lv_image>`, :ref:`List <lv_list>`, :ref:`Chart <lv_chart>`, and :ref:`Text Area <lv_textarea>`.
it_it: Esempi di Widget: :ref:`Widget Base (e Screen) <base_widget>`, :ref:`Pulsante <lv_button>`, :ref:`Etichetta <lv_label>`, :ref:`Immagine <lv_image>`, :ref:`Lista <lv_list>`, :ref:`Grafico <lv_chart>` e :ref:`Area Testo <lv_textarea>`.

source: Examples of behavior that contributes to creating a positive environment include:
it_it: Esempi di comportamento che contribuiscono a creare un ambiente positivo includono:

source: Examples of implementations of these functions exist in ``lv_obj_id_builtin.c``, but you are free to use a different design if needed.
it_it: Esempi di implementazioni di queste funzioni sono disponibili in ``lv_obj_id_builtin.c``, ma è possibile utilizzare un design diverso se necessario.

source: Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.
it_it: Esempi di rappresentanza di un progetto o di una community includono l'utilizzo di un indirizzo e-mail ufficiale del progetto, la pubblicazione tramite un account social media ufficiale o l'agire come rappresentante designato a un evento online o offline.

source: Examples of the latter are: :cpp:expr:`lv_obj_set_x(widget, value)` or :cpp:expr:`lv_obj_set_width(widget, value)`.
it_it: Esempi del secondo sono: :cpp:expr:`lv_obj_set_x(widget, value)` o :cpp:expr:`lv_obj_set_width(widget, value)`.

source: Examples of unacceptable behavior by participants include:
it_it: Esempi di comportamento inaccettabile da parte dei partecipanti includono:

source: Examples:
it_it: Esempi:

source: Examples: :u:`underline` , :ub:`underline and bold` , :bi:`bold italic` .
it_it: Esempi: :u:`underline` [sottolineato], :ub:`underline and bold` [sottolineato e grassetto], :bi:`bold italic`[grassetto corsivo].

source: Examples: size, position, color, are properties of all Widgets whereas text, long-mode, selection-start, and selection-end, are properties unique to Label Widgets.
it_it: Esempi: dimensione, posizione e colore sono proprietà di tutti i Widget, mentre testo, modalità estesa, inizio selezione e fine selezione sono proprietà esclusive dei Widget Label.

source: Exception: for the Canvas Widget the layer is always assumed to be at the (0,0) coordinate, regardless of the Canvas Widget's position.
it_it: Eccezione: per il Widget Canvas si presume che il layer si trovi sempre alla coordinata (0,0), indipendentemente dalla posizione del Widget Canvas.

source: Exception: the **Kconfig** file and any make files require leading tab characters on child items.
it_it: Eccezione: il file **Kconfig** e tutti i file make richiedono caratteri di tabulazione iniziali sugli elementi figli.

source: Exception: the substitutions.txt file contains 3 substitution definitions which are marked with the :trim: option since their use always removes these spaces in the output.
it_it: Eccezione: il file substitutions.txt contiene 3 definizioni di sostituzione contrassegnate con l'opzione :trim:, poiché il loro utilizzo rimuove sempre questi spazi nell'output.

source: Exceptions where there is no meaningful extra memory usage:
it_it: Eccezioni in cui non vi è un utilizzo significativo di memoria aggiuntiva:

source: Execute the following commands:
it_it: Eseguire i seguenti comandi:

source: Expands the rectangle in all directions; can be negative.
it_it: Espande il rettangolo in tutte le direzioni; può essere negativo.

source: Expect breaking changes.
it_it: Si prevedono cambiamenti significativi.

source: Expires end of 2025.
it_it: Scade a fine 2025.

source: Explanation of complex bindings:
it_it: Spiegazione dei binding complessi:

source: Explanation:
it_it: Spiegazione:

source: Explicitly set coordinates are stored in styles (position, size, layout, etc.).
it_it: Le coordinate impostate esplicitamente vengono memorizzate negli stili (posizione, dimensione, layout, ecc.).

source: Export and Build
it_it: Esporta e Build

source: Export code and recompile
it_it: Esporta codice e ricompila

source: Export code only
it_it: Esporta solo codice

source: Expression
it_it: Espressione

source: Extending the Click Area
it_it: Estensione dell'Area di Clic

source: Extending the current theme
it_it: Estensione del tema corrente

source: Extending themes
it_it: Estensione dei temi

source: Extending/Combining Displays
it_it: Estensione/Combinazione di Display

source: External Library Required?
it_it: Libreria Esterna Richiesta?

source: External Links
it_it: Link Esterni

source: External texture files or textures embedded within the glTF source
it_it: File texture esterni o texture incorporate nel sorgente glTF

source: Extra drawing features in LVGL can be handled by the VGLite engine.
it_it: Il motore VGLite può gestire funzionalità di disegno aggiuntive in LVGL.

source: Extract it.
it_it: Estrarre il file.

source: Extract the downloaded zip file to a folder on your computer.
it_it: Estrarre il file zip scaricato in una cartella sul computer.

source: FFmpeg Support
it_it: Supporto FFmpeg

source: FSPs can be downloaded `here <https://www.renesas.com/us/en/software-tool/flexible-software-package-fsp>`__.
it_it: Gli FSP possono essere scaricati `qui <https://www.renesas.com/us/en/software-tool/flexible-software-package-fsp>`__.

source: Factors requiring such layers are:
it_it: I fattori che richiedono tali layer sono:

source: Faded area line chart with custom division lines
it_it: Grafico a linee sfumate con linee di divisione personalizzate

source: Fallbacks
it_it: Fallback [alternative]

source: Fast GUI prototyping
it_it: Prototipazione rapida di GUI

source: Fast prototyping GUI for MVP (Minimum Viable Product) presentation.
it_it: Prototipazione rapida della GUI per la presentazione MVP (Minimum Viable Product).

source: Fast prototyping GUI.
it_it: Interfaccia grafica per prototipazione rapida.

source: Fast: optimized one-pass bytecode compiler and register-based virtual machine.
it_it: Veloce: compilatore bytecode ottimizzato a passaggio singolo e macchina virtuale basata su registri.

source: Features
it_it: Funzionalità

source: Features and restrictions:
it_it: Caratteristiche e restrizioni:

source: Features of Scrolling
it_it: Funzionalità dello Scrolling

source: Features supported:
it_it: Funzionalità supportate:

source: Feel free to adjust the other options as needed, but the default values are usually sufficient.
it_it: Si è liberi di modificare le altre opzioni in base alle proprie esigenze, ma i valori di default sono solitamente sufficienti.

source: Fetch task fetches the package source from the local or remote repository.
it_it: Il task "fetch" recupera il codice sorgente del pacchetto dal repository locale o remoto.

source: Fetched resources
it_it: Risorse recuperate

source: Fields of lv_event_t
it_it: Campi di lv_event_t

source: Fields:
it_it: Campi:

source: Figma integration
it_it: Integrazione con Figma

source: Figma to LVGL Installation
it_it: Installazione da Figma a LVGL

source: Figma to LVGL listing style properties of the selected UI element
it_it: Elenco delle proprietà di stile dell'elemento UI selezionato da Figma a LVGL

source: File Explorer
it_it: Esplora File

source: File Format Support
it_it: Supporto Formati File

source: File System Interfaces
it_it: Interfacce del File System

source: File System Support
it_it: Supporto del File System

source: File only
it_it: Solo file

source: File or variable
it_it: File o variabile

source: File systems already supported are:
it_it: I file system già supportati sono:

source: Files
it_it: File

source: Files can be used as image sources by passing in the path string to the image file to the ``lv_<widget>_set_src()`` function as the ``src`` argument.
it_it: I file possono essere utilizzati come sorgenti di immagini passando la stringa del path del file immagine alla funzione ``lv_<widget>_set_src()`` come argomento ``src``.

source: Files like the Linux kernel, root filesystem (e.g., .ext4, .tar.gz, .squashfs), bootloaders (e.g., U-Boot), and other bootable images for the device are found here.
it_it: File come il kernel Linux, il file system di root (ad esempio, .ext4, .tar.gz, .squashfs), i bootloader (ad esempio, U-Boot) e altre immagini avviabili per il dispositivo si trovano qui.

source: Files that have the ``.bb`` suffix are "recipes" files.
it_it: I file con suffisso ``.bb`` sono file "ricette" (recipe).

source: Files will buffer their reads if the corresponding ``LV_FS_*_CACHE_SIZE`` config option is set to a value greater than zero.
it_it: I file memorizzeranno le letture nel buffer se l'opzione di configurazione ``LV_FS_*_CACHE_SIZE`` corrispondente è impostata su un valore maggiore di zero.

source: Files_
it_it: File_

source: Fill
it_it: Riempimento

source: Fill Draw Descriptor
it_it: Descrittore di Disegno del Riempimento

source: Fill area with color (w/ radius or gradient).
it_it: Riempire l'area con il colore (con raggio o gradiente).

source: Fill area with color (w/o radius, w/o gradient) + optional opacity.
it_it: Riempire l'area con un colore (senza raggio, senza gradiente) + opacità opzionale.

source: Final products with a GUI without a touchscreen (i.e. 3D Printer Interface using Rotary Encoder to Input data).
it_it: Prodotti finali con una GUI senza touchscreen (ad esempio, un'interfaccia per stampante 3D che utilizza un encoder rotativo per l'inserimento dei dati).

source: Final products with a touchscreen (and all sorts of bells and whistles).
it_it: Prodotti finali con touchscreen (e tutti i tipi di ammennicoli).

source: Finally call :cpp:expr:`lv_monkey_set_enable(monkey, true)` to enable Monkey.
it_it: Infine, si chiama :cpp:expr:`lv_monkey_set_enable(monkey, true)` per abilitare Monkey.

source: Finally the layout with ``lv_conf.h`` should look like this:
it_it: Infine, il layout con ``lv_conf.h`` dovrebbe apparire così:

source: Finally, call :cpp:expr:`lv_xml_test_run_stop()` to clean up and exit testing mode.
it_it: Infine, chiama :cpp:expr:`lv_xml_test_run_stop()` per pulire e uscire dalla modalità di test.

source: Finally, the layer must be rendered to its parent layer.
it_it: Infine, il layer deve essere renderizzato sul suo layer padre.

source: Finally, when the play timeline event is triggered, the selected timeline is retrieved by its name from the target and started according to the other parameters (reverse, delay, etc).
it_it: Infine, quando viene attivato l'evento di riproduzione della timeline, la timeline selezionata viene recuperata tramite il suo nome dalla destinazione e avviata in base agli altri parametri (inversione, ritardo, ecc.).

source: Finally, widgets need to be added to the group.
it_it: Infine, i widget devono essere aggiunti al gruppo.

source: Finally, you must copy the content of ``apps/graphics/lvgl/lvgl/Kconfig`` into the middle of ``apps/graphics/lvgl/Kconfig``.
it_it: Infine, si deve copiare il contenuto di ``apps/graphics/lvgl/lvgl/Kconfig`` al centro di ``apps/graphics/lvgl/Kconfig``.

source: Find child by ID
it_it: Trovare un elemento figlio con l'ID

source: Find more information about recipes in :ref:`recipes_section` section.
it_it: Maggiori informazioni sulle ricette sono disponibili nella sezione :ref:`recipes_section`.

source: Find out more on Cmake Presets here: https://cmake.org/cmake/help/latest/manual/cmake-presets.7.html
it_it: Maggiori informazioni su Cmake Presets qui: https://cmake.org/cmake/help/latest/manual/cmake-presets.7.html

source: Find the line starting with: ``build.extra_flags=``
it_it: Trovare la riga che inizia con: ``build.extra_flags=``

source: Find the rootfs overlay option ``System configuration > Root filesystem overlay directories`` and use the relative path to the rootfs overlay with your application (**../resources/board/rootfs_overlay**) and save the configuration.
it_it: Trovare l'opzione dell'overlay rootfs ``System configuration > Root filesystem overlay directories`` e utilizzare il path relativo all'overlay rootfs con l'applicazione (**../resources/board/rootfs_overlay**) e salvare la configurazione.

source: Find your display parameters and populate a :cpp:struct:`lv_draw_eve_parameters_t` struct with them.
it_it: Trovare i parametri di visualizzazione e popolare una struct :cpp:struct:`lv_draw_eve_parameters_t` con essi.

source: Finding Nodes
it_it: Ricerca dei Nodi

source: Finding Widgets
it_it: Ricerca dei Widget

source: Firmware update process
it_it: Processo di aggiornamento del firmware

source: First Run
it_it: Prima Esecuzione

source: First draw Widget on the layer, then scale down layer opacity factor.
it_it: Per prima cosa disegna il Widget sul layer, poi riduce il fattore di opacità del layer.

source: First ensure the build artifacts have been cleared.
it_it: Assicurarsi innanzitutto che gli artefatti di build siano stati cancellati.

source: First it downloads the necessary packages to build the simulator using Debian's package manager ``apt-get``.
it_it: Per prima cosa scaricare i pacchetti necessari per compilare il simulatore utilizzando il gestore di pacchetti Debian ``apt-get``.

source: First line indent
it_it: Rientro prima riga
